/*
 * Пользователь вводит с клавиатуры число, состоящее из четырех цифр. Требуется
 * найти произведение цифр. Например, если с клавиатуры введено 1324, тогда
 * результат произведения 1*3*2*4 = 24.
 */
package IW04_03_06_2019;

import java.util.Scanner;

public class Task02 {
    public static void main(String arg[]){
        //Scanner sc = new Scanner(System.in);
        //System.out.println("Введите цифру 1:");
        //int c = sc.nextInt();
        int i = 13579;
    String s = ""+i;
    //Pri.priln
      System.out.println(s.length()+" цифр"+" последняя "+s.charAt(s.length()-5));
        //System.out.println("Произведение цифр числа равно" + ());  
    }
    
}
