/*
 * Написать программу, которая выведет на консоль "Hello world", не используя
 * в исходном коде пробельных символов.
 */
package IW27_05_2019;
public class Task04 {
    public static void main(String arg[]){
        char x = 160;
        System.out.println("Hello" + x + "World");
    }
    
}
